title: Azure Guest User Privilege Escalation
id: ab2a0702-9e32-400e-b410-897993bad169
name: azure_guest_user_priv_esc
description: Identifies when a guest user has privileges escalated to Global Administrator.
author: CTID MITRE, Michael Butt
status: experimental
date: 2022/06/07
logsource:
  product: azure
  service: activitylogs
detection:
    selection:
        CategoryValue: 'RoleManagement'
        OperationName: 'Add member to role'
        ModifiedProperties{}.NewValue|contains: 'Admin'
        targetResources.userPrincipalName|contains: '#EXT#'
    condition: selection
level: medium
tags:
    - attack.privilege_escalation
    - attack.t1078
falsepositives:
    - Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.
