title: Workspace Login Marked Suspicious
id: 87fb3484-0038-4ec5-93f6-af109151534e
description: Identifies when a workspace login is marked suspicious
author: Center for Threat-Informed Defense, Google CSA, Michael Butt
status: experimental
date: 2022/06/07
references:
    - https://github.com/GoogleCloudPlatform/security-analytics/blob/main/src/1.02/1.02.md
logsource:
  product: google_workspace
  service: google_workspace.admin
detection:
    selection:
        eventService: admin.googleapis.com
        gcp.audit.method_name:
            - google.login.LoginService.loginSuccess
        protoPayload.metadata.event.parameter|contains:  '\"boolValue\": true'
        protoPayload.metadata.event.parameter|contains:  '\"name\": \"is_suspicious\"'
    condition: selection
level: low
tags:
    - attack.initial_access
    - attack.t1078.004
falsepositives:
 - Multiple bool values in  parameter payload may trigger false positives.
